app/views/articles/active_article.html.erb

        <tr>
          <% article = Article.find(approval.article_id)%>
          <td><%= User.find(article.owner_id).username%></td>
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]