app/views/articles/active_user.html.erb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    <% @approvals.each do |approval| %>
          <% if current_user.id == Article.find(approval.article_id).owner_id %>
            <tr>
            <td><%= Article.find(approval.article_id).title %></td>
            <td><%= User.find(approval.user_id).username%></td>