app/views/articles/invitation.html.erb

            <td><%= article.agreement_date article,user %></td>
            <% @agr=Agreement.find_by(article_id:article.id,user_id:user.id)%>
---
SELECT  "agreements".* FROM "agreements" WHERE "agreements"."article_id" = $1 AND "agreements"."user_id" = $2 LIMIT $3  [["article_id", 2], ["user_id", 1], ["LIMIT", 1]]