app/controllers/articles_controller.rb

INSERT INTO "agreements" ("user_id", "article_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 3], ["article_id", 1], ["created_at", "2019-02-21 18:45:57.899199"], ["updated_at", "2019-02-21 18:45:57.899199"]]
---
	def agreement
		@article = Article.find(params[:id])
		@agreement = Agreement.new
		@agreement.user_id = current_user.id
		@agreement.article_id = @article.id
		if @agreement.save

SELECT  "agreements".* FROM "agreements" WHERE "agreements"."id" IS NULL LIMIT $1  [["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "agreements" WHERE "agreements"."user_id" = $1 AND "agreements"."article_id" = $2  [["user_id", 3], ["article_id", 1]]
DELETE FROM "agreements" WHERE "agreements"."user_id" = $1 AND "agreements"."article_id" = $2  [["user_id", 1], ["article_id", 4]]
---
	def cancel_agreement
		@article = Article.find(params[:id])
		@agree= Agreement.find(user_id:current_user.id,article_id:@article.id)
		if current_user.articles.delete(@article.id)
			@agree.destroy

DELETE FROM "agreements" WHERE "agreements"."user_id" = $1 AND "agreements"."article_id" = $2  [["user_id", 2], ["article_id", 1]]
DELETE FROM "agreements" WHERE "agreements"."id" = $1  [["id", 7]]
---
	def reject_agreement
		agr= Agreement.find(params[:id])
		user = User.find(agr.user_id)
		if user.articles.delete(agr.article_id)
			agr.destroy