app/controllers/articles_controller.rb

	def index
		if user_signed_in?
			if Profile.find_by(user_id:current_user.id)
			@profile=Profile.find_by(user_id:current_user.id)
			country = @profile.country.downcase
			city = @profile.city.downcase
			@articles=Article.where(city:city,country:country).paginate(:page => params[:page],:per_page =>10)
			else
				redirect_to new_profile_path
			end
		else
			@articles = Article.all.paginate(:page => params[:page],:per_page =>10)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."city" = $1 AND "articles"."country" = $2 LIMIT $3 OFFSET $4  [["city", "Lahore"], ["country", "Pakistan"], ["LIMIT", 10], ["OFFSET", 0]]
SELECT  "articles".* FROM "articles" LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "articles"

	def accept_approval
		agree = Agreement.find(params[:id])
		article = Article.find(agree.article_id)
		user = User.find(agree.user_id)
---
SELECT  "agreements".* FROM "agreements" WHERE "agreements"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]

	def cancel_approval
		@appr = Approval.find(params[:id])
		user = User.find(@appr.user_id)
		art= Article.find(@appr.article_id)
		@appr.user_id=nil
		@appr.article_id=nil
		if @appr.destroy
			if current_user.id == art.owner_id
			    CancelApprovalMailer.cancel_approval(user,art).deliver
				redirect_to active_user_articles_path ,notice:"Successfully Remove Employee"
			else
				CancelApprovalMailer.employee_cancel(User.find(art.owner_id),art,user).deliver
---
DELETE FROM "articles" WHERE "articles"."id" = $1  [["id", 2]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]

	def active_article
		@approvals = Approval.where(user_id:current_user.id)
		@approvals = @approvals.paginate(:page =>params[:page],:per_page =>10)
---
SELECT  "approvals".* FROM "approvals" WHERE "approvals"."user_id" = $1 LIMIT $2 OFFSET $3  [["user_id", 1], ["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "approvals" WHERE "approvals"."user_id" = $1  [["user_id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

	def send_invitation
		@articles=Article.all
		@agreements = current_user.articles
	    @agreements=@agreements.paginate(:page =>params[:page],:per_page =>10)
---
SELECT  "articles".* FROM "articles" INNER JOIN "agreements" ON "articles"."id" = "agreements"."article_id" WHERE "agreements"."user_id" = $1 LIMIT $2 OFFSET $3  [["user_id", 1], ["LIMIT", 1], ["OFFSET", 0]]
SELECT COUNT(*) FROM "articles" INNER JOIN "agreements" ON "articles"."id" = "agreements"."article_id" WHERE "agreements"."user_id" = $1  [["user_id", 1]]

	def agreement
		@article = Article.find(params[:id])
		@agreement = Agreement.new
		@agreement.user_id = current_user.id
		@agreement.article_id = @article.id
		if @agreement.save
---
INSERT INTO "agreements" ("user_id", "article_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 2], ["article_id", 12], ["created_at", "2019-02-23 16:51:55.383365"], ["updated_at", "2019-02-23 16:51:55.383365"]]