app/controllers/articles_controller.rb

	def index
		@profile=Profile.find_by(user_id:current_user.id)
		@articles=Article.where(city:@profile.city,country:@profile.country)
		@categories=Category.all
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."user_id" = $1 LIMIT $2  [["user_id", 10], ["LIMIT", 1]]
SELECT COUNT(*) FROM "articles" WHERE "articles"."city" = $1 AND "articles"."country" = $2  [["city", "lahore"], ["country", "pakistan"]]
SELECT "categories".* FROM "categories"

	def show
		@article=Article.find(params[:id])
		@profile=Profile.find_by(user_id:current_user.id)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]

	def create
		@article = Article.new(article_params)
		if @article.save
---
INSERT INTO "articles" ("title", "description", "recruiting", "skills", "employability", "country", "city", "street", "created_at", "updated_at", "owner_id", "latitude", "longitude", "category_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"

	def accept_approval
		agree = Agreement.find(params[:id])
		article = Article.find(agree.article_id)
		user = User.find(agree.user_id)
		aprroved = Approval.new
		aprroved.user_id = user.id
		aprroved.article_id = article.id
		if aprroved.save
---
SELECT  "agreements".* FROM "agreements" WHERE "agreements"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "agreements".* FROM "agreements" WHERE "agreements"."id" IS NULL LIMIT $1  [["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "approvals" ("user_id", "article_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["article_id", 4], ["created_at", "2019-02-22 22:33:17.325186"], ["updated_at", "2019-02-22 22:33:17.325186"]]
INSERT INTO "articles" ("title", "description", "recruiting", "skills", "employability", "country", "city", "street", "created_at", "updated_at", "owner_id", "latitude", "longitude", "category_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"

	def cancel_approval
		@appr = Approval.find(params[:id])
		user = User.find(@appr.user_id)
		art= Article.find(@appr.article_id)
		@appr.user_id=nil
		@appr.article_id=nil
		if @appr.destroy
			if current_user.id == art.owner_id
			    CancelApprovalMailer.cancel_approval(user,art).deliver
				redirect_to active_user_articles_path ,notice:"Successfully Remove Employee"
			else
				CancelApprovalMailer.employee_cancel(User.find(art.owner_id),art,user).deliver
---
SELECT  "approvals".* FROM "approvals" WHERE "approvals"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "articles" WHERE "articles"."id" = $1  [["id", 6]]
DELETE FROM "approvals" WHERE "approvals"."id" = $1  [["id", 1]]
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

	def active_article
		@approvals = Approval.where(user_id:current_user.id)
---
SELECT "approvals".* FROM "approvals" WHERE "approvals"."user_id" = $1  [["user_id", 1]]

	def active_user
		@approvals=Approval.all
---
SELECT "approvals".* FROM "approvals"

	def invitation
		@articles=Article.all
---
SELECT "articles".* FROM "articles"

	def agreement
		@article = Article.find(params[:id])
		@agreement = Agreement.new
		@agreement.user_id = current_user.id
		@agreement.article_id = @article.id
		if @agreement.save
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "agreements" ("user_id", "article_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 2], ["article_id", 1], ["created_at", "2019-02-23 00:02:09.411089"], ["updated_at", "2019-02-23 00:02:09.411089"]]

	def cancel_agreement
		@article = Article.find(params[:id])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

	def reject_agreement
		agr= Agreement.find(params[:id])
		@article = Article.find(agr.article_id)
		user = User.find(agr.user_id)
		if user.articles.delete(agr.article_id)
			agr.destroy
---
SELECT  "agreements".* FROM "agreements" WHERE "agreements"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
SELECT  "agreements".* FROM "agreements" WHERE "agreements"."id" = $1 LIMIT $2  [["id", 27], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "agreements" WHERE "agreements"."user_id" = $1 AND "agreements"."article_id" = $2  [["user_id", 2], ["article_id", 1]]
DELETE FROM "agreements" WHERE "agreements"."user_id" = $1 AND "agreements"."article_id" = $2  [["user_id", 1], ["article_id", 4]]

	def delete_article
		@article = Article.find(params[:id])
		@article.category_id=nil
		@article.owner_id=nil
		@article.cancel_agreement @article
		if @article.destroy
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "articles" WHERE "articles"."id" = $1  [["id", 4]]
DELETE FROM "agreements" WHERE "agreements"."id" = $1  [["id", 27]]

	def invitation_user
		@user= User.find(params[:id])
  		@profile = Profile.find_by(user_id:@user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."user_id" = $1 LIMIT $2  [["user_id", 2], ["LIMIT", 1]]