app/controllers/categories_controller.rb

	def show
		@category = Category.find(params[:id])
		if user_signed_in?
			@profile=Profile.find_by(user_id:current_user.id)
			country = @profile.country.downcase
			city = @profile.city.downcase
			@articles = Article.where(category_id:@category.id,country:country,city:city)
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."user_id" = $1 LIMIT $2  [["user_id", 2], ["LIMIT", 1]]
SELECT  "articles".* FROM "articles" WHERE "articles"."category_id" = $1 AND "articles"."country" = $2 AND "articles"."city" = $3 LIMIT $4 OFFSET $5  [["category_id", 1], ["country", "Pakistan"], ["city", "lahore"], ["LIMIT", 1], ["OFFSET", 0]]
SELECT COUNT(*) FROM "articles" WHERE "articles"."category_id" = $1 AND "articles"."country" = $2 AND "articles"."city" = $3  [["category_id", 1], ["country", "pakistan"], ["city", "lahore"]]