app/controllers/homes_controller.rb

	def home
		if user_signed_in?
			if Profile.find_by(user_id:current_user.id)
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."user_id" = $1 LIMIT $2  [["user_id", 3], ["LIMIT", 1]]