app/controllers/profiles_controller.rb

	def new
		if user_signed_in?
			unless Profile.find_by(user_id:current_user.id).nil?
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."user_id" = $1 LIMIT $2  [["user_id", 2], ["LIMIT", 1]]

	def create
		@profile = Profile.new(profile_params)
		if @profile.save
---
INSERT INTO "profiles" ("name", "surname", "education", "experience", "knowledge", "availability", "user_id", "created_at", "updated_at", "latitude", "longitude", "city", "country", "street") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"