app/models/article.rb

SELECT "agreements".* FROM "agreements" WHERE "agreements"."article_id" = $1 AND "agreements"."user_id" = $2  [["article_id", 1], ["user_id", 3]]
---
	def agreement_date article ,user
		agr=Agreement.where(article_id:article.id,user_id:user.id)