app/models/user.rb

  def agreement_found article_id
    @agreement = self.agreements
    found = false
    @agreement.each do |agre|
---
SELECT "agreements".* FROM "agreements" WHERE "agreements"."user_id" = $1  [["user_id", 3]]

  def approval_found article_id
    @approval = Approval.find_by(article_id: article_id)
---
SELECT  "approvals".* FROM "approvals" WHERE "approvals"."article_id" = $1 LIMIT $2  [["article_id", 12], ["LIMIT", 1]]