app/views/layouts/application.html.erb

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."user_id" = $1 LIMIT $2  [["user_id", 3], ["LIMIT", 1]]
---
          <div class="collapse navbar-collapse" id="navbarSupportedContent">
            <% if Profile.find_by(user_id:current_user.id)%>

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
---
                <%= link_to 'Sign Out' ,destroy_user_session_path , method: :delete ,class:"btn btn-outline-success my-2 my-sm-0"%>
              <% if Profile.find_by(user_id:current_user.id)%>
               <%= link_to 'Edit Profile' ,edit_profile_path(Profile.find_by(user_id:current_user.id)),class:"btn btn-outline-success my-2 my-sm-0 ml-2" %>